Config/Documents/ЗаданиеНаИмпортДанныхБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаИмпортДанныхБанкиКС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Вид обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект экспорта</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загрузить</Name>
							<Comment>Выбрать файл для дальнейшей загрузки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/НастройкиОбменаБанкиКСПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаБанкиКСПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/НаправлениеОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НаправлениеОбменаБанкиКС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Экспорт</Name>
					<Comment>Выгрузка из системы в казначейсткие и банковские системы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
					<Comment>Загрузка из казначейских и банковских систем</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ЗаданиеНаИмпортДанныхБанкиКС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации, МассивИменФайлов, СписокФайлов, СписокИменФайлов, ИзНихКаталогов;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект, "ФайлыОбменаЗаполнить"
																			+",ФайлыОбменаУстановитьПериод"
																			+",ФормаЗагрузитьФайлы");	
	
	Элементы.КассовыйОрган.СписокВыбора.ЗагрузитьЗначения(СписокКассовыхОрганов(Объект.Организация));
	
	Если Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая() Тогда //Новый документ
		
		ЗаполнитьЗначенияСвойств(Объект, ПолучитьНастройкиОбменаПоУмолчанию(Объект.Организация));
		
		Объект.ДатаНач 			= НачалоДня(ТекущаяДатаСеанса());
		Объект.ДатаКон 			= КонецДня(ТекущаяДатаСеанса());
		
	КонецЕсли;	
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Файлы, "ВладелецФайла", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.НастройкаОбмена) Тогда
		КаталогЗагрузки =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.НастройкаОбмена,"ПутьЗагрузкиПоУмолчанию");
	КонецЕсли;
	
	ЦветПоясняющейНадписи = ЦветаСтиля.ПоясняющийТекст;
	ЦветОшибки = ЦветаСтиля.ПоясняющийОшибкуТекст;	
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом  
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ОбновитьНадписи();	
	ОпределитьДоступностьКоманд(); 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ЗаданиеНаИмпортДанныхБанкиКС.Форма.Настройки" Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		ОбновитьНадписи();
		ОбработатьИзменениеФормата();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = ЭтотОбъект Тогда
		Если ИмяСобытия = "ВыбранаНастройкаОбменаБанкиКС" Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметр);
			ОбновитьНадписи();
			ПроверитьОбъектыОбмена();
			
			КаталогЗагрузки = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения  
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)     
	
	Оповестить("Запись_ЗаданиеНаИмпортДанныхБанкиКС", ПараметрыЗаписи, Объект.Ссылка);  
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьЗначенияСвойств(Объект, ПолучитьНастройкиОбменаПоУмолчанию(Объект.Организация, Объект.КассовыйОрган));
    ОбновитьНадписи();
	ОпределитьДоступностьКоманд();
	Элементы.КассовыйОрган.СписокВыбора.ЗагрузитьЗначения(СписокКассовыхОрганов(Объект.Организация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ Объект.Организация = ВыбранноеЗначение И  Объект.ОбъектыОбмена.Количество() > 0 Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ОрганизацияОбработкаВыбораДействие", ЭтотОбъект, ВыбранноеЗначение);
		
		ТекстВопроса = НСтр("ru='При изменении организации список объектов обмена будет очищен.
		|Продолжить с очисткой списка объектов?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, ,КодВозвратаДиалога.Нет);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбораДействие(Ответ, ВыбранноеЗначение) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Организация = ВыбранноеЗначение;
		
		Объект.ОбъектыОбмена.Очистить();
		
		Возврат
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	Прочитать();
	
КонецПроцедуры	

&НаКлиенте
Процедура КассовыйОрганОчистка(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.КассовыйОрган) Тогда
		
		Объект.ВидОбмена			= Неопределено;
		Объект.НастройкаОбмена		= Неопределено;
		Объект.НастройкаФорматов	= Неопределено;
		
		ОбновитьНадписи();	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КассовыйОрганОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;

	Если НЕ Объект.КассовыйОрган = ВыбранноеЗначение И Объект.ОбъектыОбмена.Количество() > 0 Тогда 
		
				
		Оповещение = Новый ОписаниеОповещения("КассовыйОрганОбработкаВыбораДействие", ЭтотОбъект, ВыбранноеЗначение);

		ТекстВопроса = НСтр("ru='При изменении кассового органа список объектов обмена будет очищен.
		|Продолжить с очисткой списка объектов?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, ,КодВозвратаДиалога.Нет);
		
		Возврат;
		
	Иначе
		Объект.КассовыйОрган = ВыбранноеЗначение;
	КонецЕсли;
	
	Объект.ОбъектыОбмена.Очистить();
   	ЗаполнитьЗначенияСвойств(Объект, ПолучитьНастройкиОбменаПоУмолчанию(Объект.Организация, ВыбранноеЗначение));
	ОбновитьНадписи();
	ОпределитьДоступностьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура КассовыйОрганОбработкаВыбораДействие(Ответ, ВыбранноеЗначение) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Прочитать();
		Возврат
	КонецЕсли;
	
	Объект.КассовыйОрган = ВыбранноеЗначение;
	
	Объект.ОбъектыОбмена.Очистить();
   	ЗаполнитьЗначенияСвойств(Объект, ПолучитьНастройкиОбменаПоУмолчанию(Объект.Организация, Объект.КассовыйОрган));
	ОбновитьНадписи();
	ОпределитьДоступностьКоманд();
		
КонецПроцедуры	

&НаКлиенте
Процедура ВидОбменаПриИзменении(Элемент)
	
	Массив = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
		ТипКО = ПолучитьТипКассовогоОргана(Объект.ВидОбмена);
	Иначе
		ТипКО = "";
		Объект.КассовыйОрган = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипКО) Тогда
		Массив.Добавить(Тип(ТипКО));
	Иначе
		Массив.Добавить(Тип("СправочникСсылка.Банки"));
		Массив.Добавить(Тип("СправочникСсылка.Казначейства"));
	КонецЕсли;
	
	ОписаниеТипов  	= Новый ОписаниеТипов(Массив);
	Объект.КассовыйОрган = ОписаниеТипов.ПривестиЗначение(Объект.КассовыйОрган);
	
	Элементы.КассовыйОрган.ДоступныеТипы   = ОписаниеТипов;
	Элементы.КассовыйОрган.ОграничениеТипа = ОписаниеТипов;
	
	Объект.ОбъектыОбмена.Очистить();  
	
	Элементы.ФайлыОбменаОткрытьСодержимое.Видимость   = ?(ПредставлениеВНомереВерссии() = "UFBS", Истина, Ложь);
	Элементы.ФайлыОбменаОткрытьСодержимое.Доступность = ?(ПредставлениеВНомереВерссии() = "UFBS", Истина, Ложь);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыФайлыОбмена

&НаКлиенте
Процедура ФайлыОбменаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Информация" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Элементы.ФайлыОбмена.ТекущиеДанные.Описание) Тогда
			
			ПараметрыФормыОшибок = Новый Структура("СведенияОбОшибках", Элементы.ФайлыОбмена.ТекущиеДанные.ОписаниеОшибки);
			
			ОткрытьФорму("Документ.ЗаданиеНаИмпортДанныхБанкиКС.Форма.Ошибки", ПараметрыФормыОшибок, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыОбменаПередУдалением(Элемент, Отказ)
	Данные = Элементы.ФайлыОбмена.ТекущиеДанные;
	УдалитьПрисоединенныйФайл(Объект.Ссылка, Данные.ИмяФайлаЗагрузки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
			
	ЕстьОшибкиВЗаполненииНастроек = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ЕстьОшибкиВЗаполненииНастроек = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Организация>> в настройках обмена'"),, "Объект.Организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КассовыйОрган) Тогда
		ЕстьОшибкиВЗаполненииНастроек = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Кассовый орган>> в настройках обмена'"),, "Объект.КассовыйОрган");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНач) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаКон) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан период. Воспользуйтесь кнопкой ""Задать период""'"),,,,ЕстьОшибкиВЗаполненииНастроек);		
	КонецЕсли;

	Если ЕстьОшибкиВЗаполненииНастроек Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "";
	ОписаниеОповещенияОЗавершении = Неопределено;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ТекстВопроса = НСтр("ru='Перед заполнением файлов необходимо записать документ. 
		|Записать?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаписатьИЗаполнить", ЭтотОбъект);
								
	ИначеЕсли Объект.ОбъектыОбмена.Количество() > 0 ИЛИ Объект.ФайлыОбмена.Количество()>0 Тогда
		
		ТекстВопроса = 	НСтр("ru = 'Существующие строки документа будут удалены. 
		|Продолжить?'");	
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("УдалитьСтрокиИЗаполнить", ЭтотОбъект);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
		
	ЗаполнитьДействие();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗаполнить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	
	ЗаполнитьДействие();

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиИЗаполнить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбъектыОбмена.Очистить();
	
	ЗаполнитьДействие();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействие()
	
	КаталогЗагрузки = КаталогЗагрузкиПоУмолчанию(Объект.НастройкаОбмена);
	
	Если ПустаяСтрока(КаталогЗагрузки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Каталог загрузки>> в настройках обмена'"));
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = Новый Массив;
	
	#Если ВебКлиент Тогда
				
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьПодключениеРасширенияРаботыСФайлами", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения,
			НСтр("ru = 'Рекомендуется установить расширение для работы с файлами (не обязательное действие).'"), Истина);
		
		Возврат;
		
	#Иначе
		
		ЗаполнитьСписокФайловМножественный();	
		
	#КонецЕсли
	
	Модифицированность = Истина;
	
	ОпределитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодключениеРасширенияРаботыСФайлами(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда		
		ЗаполнитьСписокФайловМножественный();				
	Иначе		
		ЗаполнитьСписокФайловБезУстановкиРасширения();	
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ОпределитьДоступностьКоманд();
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода",Объект.ДатаНач, Объект.ДатаКон);

	ОткрытьФорму("ОбщаяФорма.НастройкаПериодаОтчета",ПараметрыФормы,,,,, Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйПериод) = Тип("Структура") Тогда
		Объект.ДатаНач = ВыбранныйПериод.НачалоПериода;
		Объект.ДатаКон = ВыбранныйПериод.КонецПериода;
		ОбновитьНадписи();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	Данные = Элементы.ФайлыОбмена.ТекущиеДанные;
	Если Данные = Неопределено тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана строка с документом'"));
		Возврат;
	КонецЕсли;
	Если не ЗначениеЗаполнено(Данные.Формат) тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен формат'"),, "Элементы.ФайлыОбмена.ТекущиеДанные.Формат");
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Данные.ИмяФайлаЗагрузки) тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет имени файла'"),, "Элементы.ФайлыОбмена.ТекущаяСтрока.ИмяФайлаЗагрузки");
		Возврат;
	КонецЕсли;
	ОписаниеОшибки = "";
	
	Попытка
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(	"Документ.ЗаданиеНаИмпортДанныхБанкиКС",
														"МакетФормата", 
														ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка),
														ЭтотОбъект,
														Новый Структура(	"Формат, ИмяФайла, Ссылка",
																			Данные.Формат,
																			Данные.ИмяФайлаЗагрузки,
																			Объект.Ссылка));
	Исключение
		// Исключение не отрабатываем, т.к. в команде печати уже сделаны все необходимые сообщения пользователю
	КонецПопытки;

КонецПроцедуры  

&НаКлиенте
Процедура ПросмотретьПодписанныеФайлы(Команда)
	
	ПараметрыФормыДекодирования = Новый Структура("КаталогЗагрузки, ВидОбмена, Задание", КаталогЗагрузкиПоУмолчанию(Объект.НастройкаОбмена), Объект.ВидОбмена, Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаданиеНаИмпортДанныхБанкиКС.Форма.ПодписанныеФайлыУФЭБС", ПараметрыФормыДекодирования, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлы(Команда)
	ТекстПредупреждения = "";
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Поле ""Организация"" не заполнено'"),,"Объект.Организация",,Отказ);
	КонецЕсли;
	Отбор = Новый Структура("Загрузить", Истина);
	Если Объект.ФайлыОбмена.НайтиСтроки(Отбор).Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран ни один файл для загрузки'"),,"Объект.ФайлыОбмена",,Отказ);
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Невозможно выполнить загрузку для проведенного документа'"),,,,Отказ);		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Перед загрузкой документ будет записан.
								|Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьФайлыЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ЗагрузитьФайлыДействие();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьФайлыДействие();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлыДействие()
	
	Отказ            = Ложь;
		
	ЗаданиеВыполнено = ЗагрузитьОбъекты(Отказ);	
	
	Если НЕ ЗаданиеВыполнено Тогда	
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтотОбъект);
		
	Иначе
	    	
	    ВызватьДиалогКонтрагентов();
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуПослеЗагрузки()
	
	Если Объект.ОбъектыОбмена.Количество() > 0 Тогда
		
		Элементы.ИмпортДокументов.ТекущаяСтраница = Элементы.ОбъектыИмпорта;
		
		Для Каждого СтрТЧ Из Объект.ОбъектыОбмена Цикл
			ОповеститьОбИзменении(СтрТЧ.Объект);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормы.Вставить("Организация", 			Объект.Организация);
	ПараметрыФормы.Вставить("Отбор", 				Новый Структура("Организация", Объект.Организация));
	ПараметрыФормы.Вставить("КассовыйОрган",		Объект.КассовыйОрган);
	ПараметрыФормы.Вставить("ВидОбмена", 			Объект.ВидОбмена);
	ПараметрыФормы.Вставить("НастройкаОбмена", 		Объект.НастройкаОбмена);
	ПараметрыФормы.Вставить("НастройкаФорматов",	Объект.НастройкаФорматов);
	
	ОткрытьФорму("РегистрСведений.НастройкиОбменаБанкиКСПоУмолчанию.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если РеквизитыЗаполненыКорректно() Тогда
		ЗаписатьНастройкиПоУмолчанию();		
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПредставлениеВНомереВерссии()
	
	Если ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
		Возврат Объект.ВидОбмена.ПредставлениеВНомереВерсии;
	КонецЕсли; 
	
	Возврат "";   
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьТипКассовогоОргана(ВидОбмена)

	Возврат ВидОбмена.ТипКассовогоОргана;

КонецФункции

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
	
	НастройкиПоУмолчанию = РегистрыСведений.НастройкиОбменаБанкиКСПоУмолчанию.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(НастройкиПоУмолчанию, Объект, "Организация,ВидОбмена,КассовыйОрган");	// заполняем ключ записи
	НастройкиПоУмолчанию.Прочитать();																// читаем запись чтобы получить реквизит "Основная"
	ЗаполнитьЗначенияСвойств(НастройкиПоУмолчанию, Объект, "НастройкаФорматов,НастройкаОбмена");	// заполняем ресурсы записи
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		НастройкиПоУмолчанию.Записать();
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка записи настроек. ""%1""'"), ОписаниеОшибки());			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
			
КонецПроцедуры

&НаКлиенте
Функция РеквизитыЗаполненыКорректно()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ВидОбмена) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Вид обмена>>'"),, "ВидОбмена",, Отказ);	
	КонецЕсли; 
			
	Если Не ЗначениеЗаполнено(Объект.НастройкаФорматов) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Настройка форматов>>'"),, "НастройкаФорматов",, Отказ);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.НастройкаОбмена) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Настройка обмена>>'"),, "НастройкаОбмена",, Отказ);	
	КонецЕсли;

	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписи()
	
	ТекстЗаголовкаКнопки = НСтр("ru='Заполнить объектами за период: с [ДатаНач] по [ДатаКон]'");
	ТекстЗаголовкаКнопки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	ТекстЗаголовкаКнопки,
																					Новый Структура("ДатаНач, ДатаКон",
																									Формат(Объект.ДатаНач, "ДЛФ=D"),
																									Формат(Объект.ДатаКон, "ДЛФ=D")));
	Элементы.ФайлыОбмена.КоманднаяПанель.ПодчиненныеЭлементы.ФайлыОбменаЗаполнить.Заголовок = ТекстЗаголовкаКнопки;
															
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокКассовыхОрганов(Организация)
	
	Возврат ПлатежноРасчетныеДокументыПовтИсп.ПолучитьКассовыеОрганыОрганизации(Организация);
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьНастройкиОбменаПоУмолчанию(Организация, КассовыйОрган = Неопределено)
	
	Возврат РегистрыСведений.НастройкиОбменаБанкиКСПоУмолчанию.ПолучитьОсновнуюНастройкуОбменаОрганизации(Организация, КассовыйОрган);
	
КонецФункции	

&НаСервере
Процедура ПроверитьОбъектыОбмена()
	
	Если Объект.ОбъектыОбмена.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
			
			Если Объект.ОбъектыОбмена[0].Формат <> Объект.ВидОбмена Тогда		
				Объект.ОбъектыОбмена.Очистить();		
			КонецЕсли; 
			
		Иначе		
			Объект.ОбъектыОбмена.Очистить();		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьОбъекты(Отказ)
		
	Если Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли;	
	                                                        		
	АдресХранилища     = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
	ПараметрыФЗ         = Новый Структура("ЗаданиеНаИмпорт", Объект.Ссылка);				
	НаименованиеЗадания = НСтр("ru = 'Импорт файлов из казначейских и банковских систем'");
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания   = 4;
	Иначе
		ВремяОжидания   = 2;
	КонецЕсли;
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыФЗ);	
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
		
	Задание = ФоновыеЗадания.Выполнить(
	"ФоновыеЗаданияОбменСКазначейскимиИБанковскимиСистемами.ЗагрузитьОбъектыИзЗадания", 
		ПараметрыЭкспортнойПроцедуры, , НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	Прочитать();
	
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор);  	
				
КонецФункции	

&НаСервере
Процедура ОбработатьРезультат()
	
	ЭтотОбъект.Прочитать();
	ЗаданиеНаИмпорт = РеквизитФормыВЗначение("Объект");
	
	// задание выполнено	
	ПоказатьВсеСообщения(ИдентификаторЗадания, УникальныйИдентификатор); // В случае работы в клиент-серверном режиме
	
	Отказ = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ЗаданиеНаИмпорт = РеквизитФормыВЗначение("Объект");	
	Документы.ЗаданиеНаИмпортДанныхБанкиКС.РаспределитьОбъектыПоУчреждениям(ЗаданиеНаИмпорт);
	
	ЗначениеВРеквизитФормы(ЗаданиеНаИмпорт, "Объект");
	Модифицированность = ЗаданиеНаИмпорт.Модифицированность();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ПоказатьВсеСообщения(ИдентификаторЗадания, ИдентификаторФормы)
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание <> Неопределено Тогда
		МассивСообщений = Задание.ПолучитьСообщенияПользователю();
		Если МассивСообщений <> Неопределено Тогда
			Для Каждого Сообщение Из МассивСообщений Цикл
				Сообщение.ИдентификаторНазначения = ИдентификаторФормы;
				Сообщение.Сообщить();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ФоновоеЗаданиеИдентификатор)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка 
		
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
						
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);			
			
			ВызватьДиалогКонтрагентов();
						
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ПоказатьВсеСообщения(ИдентификаторЗадания, УникальныйИдентификатор);
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;	
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьДиалогКонтрагентов()
	
	Перем ВызыватьДиалог, ДанныеКонтрагентов, Отказ, ПараметрыФормыКонтрагентов, Результат;
	
	Результат          = ПолучитьИзВременногоХранилища(АдресХранилища);
	Отказ              = Результат.Отказ;
	ДанныеКонтрагентов = Результат.ДанныеНовыхКонтрагентов;
	ВызыватьДиалог     = Результат.ВызыватьДиалог;
	
	ОбработатьРезультат();
	
	Если Отказ <> Неопределено Тогда
		
		Если НЕ Отказ Тогда
			
			ПереключитьСтраницуПослеЗагрузки();
			
			Если ВызыватьДиалог Тогда
				
				ПараметрыФормыКонтрагентов = Новый Структура("ЗагруженныеКонтрагенты", ДанныеКонтрагентов);			
				ОткрытьФорму("Документ.ЗаданиеНаИмпортДанныхБанкиКС.Форма.ЗагруженныеКонтраненты", ПараметрыФормыКонтрагентов, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе
				ПоказатьПредупреждение(Неопределено, НСтр("ru='Загрузка данных из файлов импорта выполнена!'"));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОпределитьДоступностьКоманд()  
	
	Элементы.ФормаЗагрузитьФайлы.Доступность   = Объект.ФайлыОбмена.Количество() > 0 И НЕ ТолькоПросмотр;    
	
	Элементы.ФайлыОбменаОткрытьСодержимое.Видимость   = ?(ПредставлениеВНомереВерссии() = "UFBS", Истина, Ложь);
	Элементы.ФайлыОбменаОткрытьСодержимое.Доступность = ?(ПредставлениеВНомереВерссии() = "UFBS", Истина, Ложь); 
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПрисоединенныйФайл(ОбъектСсылка,	ИмяФайла)
	Документы.ЗаданиеНаИмпортДанныхБанкиКС.УдалитьПодчиненныйФайл(ОбъектСсылка,	ИмяФайла);	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьИзменениеФормата()
	
	ПроверитьОбъектыОбмена();

	КаталогЗагрузки = КаталогЗагрузкиПоУмолчанию(Объект.НастройкаОбмена);
	
КонецПроцедуры // ОбработатьИзменениеФормата()
 
&НаСервереБезКонтекста
Функция КаталогЗагрузкиПоУмолчанию(НастройкаОбмена)

	Возврат  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаОбмена,"ПутьЗагрузкиПоУмолчанию");	

КонецФункции // КаталогЗагрузкиПоУмолчанию()

&НаСервереБезКонтекста
Процедура СделатьЗаписьВЖурналеРегистрации(СписокОшибок)
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СписокОшибок);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокФайлов(СписокФайловВКаталоге, ДополнительныеПараметры = Неопределено) Экспорт
	
	СписокФайлов     = СписокФайловВКаталоге;
	МассивИменФайлов = Новый Массив;
	ИзНихКаталогов   = 0;
	
	Для каждого ТекФайл Из СписокФайлов Цикл				
		Оповещение = Новый ОписаниеОповещения(
					"ПослеПроверкиНаКаталог", ЭтотОбъект, СократитьИмяФайла(ТекФайл.Имя));
		ТекФайл.НачатьПроверкуЭтоКаталог(Оповещение);
		
	КонецЦикла; 
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиНаКаталог(ЭтоКаталог, ИмяФайла) Экспорт
	
	Если ЭтоКаталог Тогда
		ИзНихКаталогов = ИзНихКаталогов + 1;
		Возврат;
	КонецЕсли;
	
	МассивИменФайлов.Добавить(ИмяФайла);
	
	Если МассивИменФайлов.Количество() + ИзНихКаталогов <> СписокФайлов.Количество() Тогда
		Возврат; // ждем завершения проверки всех файлов на каталоги
	КонецЕсли;
	
	МассивПроверенныхФайлов = ПроверитьИменаФайловНаСервере(МассивИменФайлов);
	
	Если МассивПроверенныхФайлов.Количество()=0 Тогда
		ТекстСообщения = НСтр("ru='Не найдено файлов, соответствующих условию'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПомещаемыеФайлы     = Новый Массив;
	МассивИменФайлов    = Новый Массив;
	МассивАдресовФайлов = Новый Массив;
	
	Для каждого ТекФайл Из СписокФайлов Цикл
		Если МассивПроверенныхФайлов.Найти(СократитьИмяФайла(ТекФайл.Имя))<>Неопределено Тогда
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ТекФайл.ПолноеИмя));
		КонецЕсли;
	КонецЦикла; 
	
	ПомещенныеФайлы = Новый Массив;
	
	Попытка
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТаблицуЗагружаемыхФайловПоОписаниям", ЭтотОбъект); 
		НачатьПомещениеФайлов(ОписаниеОповещения, ПомещаемыеФайлы, , Ложь, УникальныйИдентификатор);
	Исключение
		ОписаниеОшибки = НСтр("ru='Ошибка передачи файлов на сервер. Подробности в журнале регистрации'");
		СписокОшибок   = Новый СписокЗначений;  
		СписокОшибок.Добавить(Новый Структура(	"ИмяСобытия, ПредставлениеУровня, Комментарий", 
												"Задание на импорт данных.Передача файлов",
												"Ошибка",
												ОписаниеОшибки()));
		СделатьЗаписьВЖурналеРегистрации(СписокОшибок);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
		ЗаполнитьТаблицуЗагружаемыхФайловПоОписаниям(ПомещенныеФайлы);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокФайловМножественный()
	
    ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьСписокФайлов", ЭтотОбъект); 
	НачатьПоискФайлов(ОписаниеОповещения, КаталогЗагрузки, "*.???", Истина);
	
КонецПроцедуры // ЗаполнитьСписокФайловМножественный()

&НаСервере
Функция ПроверитьИменаФайловНаСервере(МассивИменФайлов, ОчищатьТаблицуФайлов = Ложь)
	
	УдалитьВсеПодчиненныеФайлы();
	
	СхемаПроверки = БиблиотекаФункцийОбмена.СоздатьСхемуПроверкиИменФайлов(МассивИменФайлов, Объект.ВидОбмена, Объект.Организация);

	МассивПроверенныхФайлов = БиблиотекаФункцийОбмена.ПроверитьМассивФайловПоПравилу(МассивИменФайлов, СхемаПроверки, Объект);
	
	Возврат МассивПроверенныхФайлов;
	
КонецФункции // ПроверитьИменаФайловНаСервере()

&НаКлиентеНаСервереБезКонтекста
Функция СократитьИмяФайла(Знач ВыбранноеИмяФайла)

	Поз = Макс(Найти(ВыбранноеИмяФайла, "/"), Найти(ВыбранноеИмяФайла, "\"));
	Пока Поз>0 Цикл
		ВыбранноеИмяФайла = Сред(ВыбранноеИмяФайла, Поз+1);
		Поз = Макс(Найти(ВыбранноеИмяФайла, "/"), Найти(ВыбранноеИмяФайла, "\"));
	КонецЦикла;
	Возврат ВыбранноеИмяФайла;

КонецФункции // СократитьИмяФайла()

&НаКлиенте
Процедура ЗаполнитьСписокФайловБезУстановкиРасширения()

	МассивАдресовФайлов = Новый Массив;
	СписокИменФайлов    = Новый Структура;
		
	ОчиститьСообщения();
	
	ОписаниеОповещения                = Новый ОписаниеОповещения("ЗаполнитьТаблицуЗагружаемыхФайловПоОписаниям", ЭтотОбъект); 
	ОписаниеОповещенияПередПомещением = Новый ОписаниеОповещения("ПрисвоитьФайламИмя", ЭтотОбъект); 
	
	Диалог                            = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    НачатьПомещениеФайлов(ОписаниеОповещения, Диалог, Истина, УникальныйИдентификатор)
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьФайламИмя(ПомещаемыеФайлы, Отказ, ДополнительныеПараметры = Неопределено) Экспорт

	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	Для каждого Файл Из ПомещаемыеФайлы Цикл
		СписокИменФайлов.Вставить("Инд_" + СтрЗаменить(Файл.ИдентификаторФайла, "-", "_"), Файл.Имя);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуЗагружаемыхФайловПоОписаниям(МассивОписаний, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СписокИменФайлов) И (ДополнительныеПараметры = Неопределено) Тогда
		
		ДополнительныеПараметры = Новый Структура("СписокИменФайлов", Новый Структура);
		
		Для каждого ИмяФайла Из СписокИменФайлов Цикл
			ДополнительныеПараметры.СписокИменФайлов.Вставить(ИмяФайла.Ключ, ИмяФайла.Значение)
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьТаблицуЗагружаемыхФайловПоОписаниямСервер(МассивОписаний, ДополнительныеПараметры);
	ОпределитьДоступностьКоманд();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗагружаемыхФайловПоОписаниямСервер(МассивОписаний, ДополнительныеПараметры) 
	
	УдалитьВсеПодчиненныеФайлы();
	
	Если МассивОписаний = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ЕстьСписокИменФайлов = ?(ЗначениеЗаполнено(ДополнительныеПараметры), ДополнительныеПараметры.Свойство("СписокИменФайлов"), Ложь) И ЗначениеЗаполнено(ДополнительныеПараметры.СписокИменФайлов);
	
	Для каждого ТекОписание Из МассивОписаний Цикл
	
		ИмяФайла             = СократитьИмяФайла(ТекОписание.Имя);
		
		Если НЕ ЗначениеЗаполнено(ИмяФайла) И ЕстьСписокИменФайлов Тогда
			 ИмяФайла = ДополнительныеПараметры.СписокИменФайлов["Инд_" + СтрЗаменить(ТекОписание.ИдентификаторФайла, "-", "_")];
		КонецЕсли;
		
		ИмяВременногоФайла   = ПолучитьИмяВременногоФайла();
		ПолучитьИзВременногоХранилища(ТекОписание.Хранение).Записать(ИмяВременногоФайла);
		
		ТипОбмена            = "";
		ПредполагаемыйФормат = "";
		СообщениеОбОшибке    = "";
		
		Если БиблиотекаФункцийОбмена.ВСистемеЕстьФорматДляИмпортируемогоФайла(ПредполагаемыйФормат, Объект.ВидОбмена, ИмяВременногоФайла, СообщениеОбОшибке, , ИмяФайла) Тогда
			
			АдресФайлаВоВременномХранилище 	= ТекОписание.Хранение;
			
			РаботаСФайлами.ДобавитьФайл(
		 	Новый Структура("ВладелецФайлов, ИмяБезРасширения, РасширениеБезТочки, Автор, ВремяИзмененияУниверсальное",  
		 	Объект.Ссылка, 
			Лев(ИмяФайла,  СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца) - 1),
			Сред(ИмяФайла, СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца) + 1), 
			Пользователи.ТекущийПользователь(),
			УниверсальноеВремя(ТекущаяДатаСеанса())),     
		    АдресФайлаВоВременномХранилище);	
								 
			//список форматов используется в обменах УФЭБС, так как в обном пакете могут содержаться 
			//разные форматы банковских сообщений
			Если ТипЗнч(ПредполагаемыйФормат) = Тип("Массив") Тогда 
				
				Для Каждого ФорматСтрока Из ПредполагаемыйФормат Цикл
					
					Строка                  = Объект.ФайлыОбмена.Добавить();
				
					Строка.ИмяФайлаЗагрузки = ИмяФайла;
					Строка.Формат           = ФорматСтрока;
					Строка.ТипОбъекта       = ФорматСтрока.ПредставлениеОбъектаВНастройке;
					Строка.Загрузить        = Истина;
					
					Строка.ПолноеИмяФайла   = ИмяФайла;   
					
				КонецЦикла;	
				
			Иначе	
			
				Строка                  = Объект.ФайлыОбмена.Добавить();
				
				Строка.ИмяФайлаЗагрузки = ИмяФайла;
				Строка.Формат           = ПредполагаемыйФормат;
				Строка.ТипОбъекта       = ПредполагаемыйФормат.ПредставлениеОбъектаВНастройке;
				Строка.Загрузить        = Истина;
				
				Строка.ПолноеИмяФайла   = ИмяФайла;   
				
			КонецЕсли;	
			
		Иначе
						
			ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке + НСтр("ru = ' Данные из файла '") + ИмяФайла + НСтр("ru = ' не могут быть импортированы!'"));
			
		КонецЕсли;
	
	КонецЦикла; 	

КонецПроцедуры // ЗаполнитьТаблицуЗагружаемыхФайловБезПроверки()

&НаСервере
Процедура ЗаполнитьТаблицуЗагружаемыхФайловПоСписку(МассивИменФайлов, МассивАдресовФайлов)

	УдалитьВсеПодчиненныеФайлы();
	
	СхемаПроверки = БиблиотекаФункцийОбмена.СоздатьСхемуПроверкиИменФайлов(МассивИменФайлов, Объект.ВидОбмена, Объект.Организация);
	МассивПроверенныхФайлов = БиблиотекаФункцийОбмена.ПроверитьМассивФайловПоПравилу(МассивИменФайлов, СхемаПроверки, Объект);

	Для Счетчик = 0 По МассивИменФайлов.ВГраница() Цикл
		
		ИмяФайла = МассивИменФайлов[Счетчик];
		Если МассивПроверенныхФайлов.Найти(ИмяФайла) <> Неопределено Тогда
			// Файл подходит под формат загрузки
			// будем искать для него правила загрузки в базе
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
			ПолучитьИзВременногоХранилища(МассивАдресовФайлов[Счетчик]).Записать(ИмяВременногоФайла);
			
			ТипОбмена = "";
			ПредполагаемыйФормат = "";
			Если БиблиотекаФункцийОбмена.ВСистемеЕстьФорматДляИмпортируемогоФайла(ПредполагаемыйФормат, Объект.ВидОбмена, ИмяВременногоФайла,, Перечисления.НаправлениеОбменаБанкиКС.Импорт, ИмяФайла) Тогда
				
				АдресФайлаВоВременномХранилище 	= МассивАдресовФайлов[Счетчик];
				
				РаботаСФайлами.ДобавитьФайл(
			 	Новый Структура("ВладелецФайлов, ИмяБезРасширения, РасширениеБезТочки, Автор, ВремяИзмененияУниверсальное",  
			 	Объект.Ссылка, 
				Лев(ИмяФайла, Найти(ИмяФайла, ".") - 1),
				Сред(ИмяФайла, Найти(ИмяФайла, ".") + 1), 
				Пользователи.ТекущийПользователь(),
				УниверсальноеВремя(ТекущаяДатаСеанса())),     
			    АдресФайлаВоВременномХранилище);								 
												 
				Строка                  = Объект.ФайлыОбмена.Добавить();
				
				Строка.ИмяФайлаЗагрузки = ИмяФайла;
				Строка.Формат           = ПредполагаемыйФормат;
				Строка.ТипОбъекта       = ПредполагаемыйФормат.ПредставлениеОбъектаВНастройке;
				Строка.Загрузить        = Истина;
				
				Строка.ПолноеИмяФайла   = ИмяФайла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаблицуЗагружаемыхФайловПоСписку()
 
&НаСервере
Процедура УдалитьВсеПодчиненныеФайлы()
	
	Объект.ФайлыОбмена.Очистить();
    МассивФайлов 	= Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Объект.Ссылка,МассивФайлов);

	УстановитьПривилегированныйРежим(Истина);
	Для каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		
		ПрисоединенныйФайл.ПолучитьОбъект().Удалить();
			
	КонецЦикла; 
	

КонецПроцедуры // УдалитьВсеПодчиненныеФайлы()

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры


#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
